# Alpha Vantage API Introduction

# Stock time Series

In [1]:
import pandas as pd
import numpy as np

### Import the timeseries fucntions from the alpha vantage module

In [2]:
from alpha_vantage.timeseries import TimeSeries

### Define the api key that you'll get by visisting the website : https://www.alphavantage.co/support/#api-key

In [3]:
api_key = open('alpha_vantage_apikey.txt','r').read()

### initialize the api key and the format type

In [4]:
ts = TimeSeries(key=api_key,output_format='pandas')

## Daily time series :

**get_daily()** returns daily time series up to 20 years. Here it returns a tuple; a **pandas Dataframe**, and a **dictionary**

In [20]:
df,o = ts.get_daily(symbol='SBUX',outputsize='full')#getting the daily data of the starbucks stock

- **symbol** : the stock symbol on the market.(ex: Starbucks / SBUX)
- **outputsize ** : defines the amount of data we want to retrieve. Setting **full** will return up to 20 years worth of data. With **compact**, we retrieve the last 100 entries. By default **compact**

In [21]:
df.head()

            1. open  2. high  3. low  4. close  5. volume
date
1998-01-02    38.38    38.63   37.31     37.63   651100.0
1998-01-05    37.63    37.78   36.75     37.13   700600.0
1998-01-06    37.13    37.38   35.56     35.69  1230800.0
1998-01-07    35.50    36.44   34.25     34.69  2164200.0
1998-01-08    34.56    36.00   34.00     35.75  1692800.0

In [11]:
df.tail()

            1. open  2. high   3. low  4. close  5. volume
date
2018-11-12    42.50    42.84  41.2800     41.89  4512830.0
2018-11-13    42.21    42.86  41.9801     42.55  3953012.0
2018-11-14    43.13    43.93  42.4090     42.72  3726019.0
2018-11-15    42.40    44.24  42.2100     43.86  3509715.0
2018-11-16    43.36    43.73  42.5600     43.30  4290871.0

**Meta data dictionary**

In [23]:
o

{'1. Information': 'Daily Prices (open, high, low, close) and Volumes',
 '2. Symbol': 'SBUX',
 '3. Last Refreshed': '2018-11-16',
 '4. Output Size': 'Full size',
 '5. Time Zone': 'US/Eastern'}

## <u>Weekly Time Series</u>

returns last trading day of each week

In [26]:
w,wd = ts.get_weekly(symbol='SBUX')

**Metadata**

In [27]:
wd

{'1. Information': 'Weekly Prices (open, high, low, close) and Volumes',
 '2. Symbol': 'SBUX',
 '3. Last Refreshed': '2018-11-16',
 '4. Time Zone': 'US/Eastern'}

In [30]:
w.head()

            1. open  2. high  3. low  4. close  5. volume
date
1998-01-09    37.63    37.78   34.00     35.13  6509000.0
1998-01-16    34.50    35.63   33.75     34.03  3759100.0
1998-01-23    34.25    36.50   33.63     34.88  4463500.0
1998-01-30    35.13    37.13   33.13     36.56  5925400.0
1998-02-06    37.00    39.13   36.69     38.13  4771700.0

## <u>Monthly Time Series</u>

Returns last trading day of each month

In [32]:
m,md = ts.get_monthly(symbol='SBUX')

In [33]:
m.head()

            1. open  2. high  3. low  4. close   5. volume
date
1998-02-27    37.00    40.13   36.00     39.56  19373700.0
1998-03-31    39.56    46.44   38.13     45.31  18562900.0
1998-04-30    45.38    49.00   42.50     48.13  20675700.0
1998-05-29    48.25    49.88   44.50     48.00  14596100.0
1998-06-30    47.63    54.75   46.56     53.44  22684400.0